app/controllers/movies_controller.rb

  def index
    if session[:ratings]==nil
	params[:ratings]=Hash[Movie.all_ratings.map {|rating| [rating,"1"] }]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R') ORDER BY release_date